{
  "intro": {
    "title": "Intro",
    "desc": "Hello! I'm Cale DePaolo, a passionate web developer and digital enthusiast based in the beautiful state of Wyoming. I've developed a strong foundation in creating seamless, user-friendly websites and applications. My journey started with a curiosity for coding and has quickly evolved into a rewarding career where I help companies create unique digital solutions. When I'm not immersed in coding, you can find me exploring Wyoming's stunning landscapes, experimenting with new recipes in the kitchen, or out at my local course for a round of golf. I believe in continuous learning and staying ahead of the curve in this fast-paced digital world. Welcome to my corner of the internet, where I share my projects and a little about myself. Let's build something amazing together!"
  },
  "bio": {
    "title": "Bio",
    "desc": ["I am a versatile software developer currently engaged in two exciting projects: developing this website and prototyping a web-based solution for a potential startup. In my experience as a Front-End Software Engineer at Teladoc Health, I had the privilege of working with the myStrength team, where I honed my skills alongside a group of exceptional developers. This role significantly enhanced my full stack development abilities, complementing my prior focus on back-end development, API creation, and unit testing during my academic projects, internships and previous roles", 
    "My senior design project with Western EcoSystems Technology (WEST) involved leveraging their AI model to create a solution for processing visual information, further broadening my technical expertise. I am passionate about learning and implementing new technologies to develop innovative software solutions.",
    "Currently, I am seeking my next professional opportunity in software development. I aim to continue expanding my skills and aspire to grow into a senior engineering role. I am eager to join a forward-thinking company that values continuous learning and offers opportunities for career advancement."]
  }
}
