[
  {
    "date": "2011 - 2014",
    "title": "Studying Radiology and Future Career Outlook",
    "desc": [
      {
        "p": "From 2009 to 2011, I pursued a radiology program in Colorado, initially drawn to the field due to my passion for photography. However, by 2011, the rapid shift towards digital platforms in medical imagery drastically reduced the demand for radiologists, diminishing the field by a significant amount. Concerned about the industry's future trajectory, I made the decision to withdraw from school and take time to reassess my educational and career path. During this period, I continued to advance in my culinary career while exploring options for my future endeavors."
      }
    ]
  },
    {
    "date": "2014 - 2017",
    "title": "Starting My Education in Computer Science",
    "desc": [
      {
        "p": "After careful consideration of my strengths and career aspirations, I made the decision to return to school in 2014. During my time away, I developed a keen interest in embedded programming and leveraging sensory input data for software applications. Upon returning, I strategically selected electives that would provide practical benefits in the tech industry, including multiple networking courses and additional programming subjects beyond the standard curriculum. I actively participated in BYTE Club, collaborating on various projects outside of coursework."
      },
      {
        "p": "Balancing full-time work alongside my studies, I graduated in 2017 with an Associate of Applied Science in Computer Science, achieving a 3.4 GPA. This period not only solidified my technical skills but also reaffirmed my passion for software development and prepared me for the next phase of my career journey."
      }
    ]
  },
    {
    "date": "2017 - 2018",
    "title": "Engineering and Computer Science",
    "desc": [
      {
        "p": "Following my graduation with an associate degree, I recognized the importance of further education in the tech industry, where a bachelor's degree is often a prerequisite. Inspired by my brother, a mechanical engineer, I decided to explore engineering, specifically focusing on electrical and software engineering."
      },
      {
        "p": "I enrolled at Casper College for an additional year to delve deeper into engineering concepts before committing to a specific bachelor's program. Collaborating closely with advisors from both Casper College and the University of Wyoming, I carefully selected courses that would provide exposure to engineering disciplines while fulfilling transfer requirements. This intensive year included 34 credits exclusively in STEM and engineering fields, enriching my understanding and clarifying my academic and career interests."
      },
      {
        "p": "Through this experience, I gained valuable insights into the similarities between electrical engineering and computer science, affirming my affinity for software development and the digital realm over physical engineering. This foundational year not only prepared me for my future academic endeavors but also solidified my career path in software development."
      },
      {
        "p": "During this period, I also embarked on my first internship, gaining practical experience that reinforced my passion for software engineering and affirmed my decision to pursue this field professionally."
      }
    ]
  },
    {
    "date": "2018",
    "title": "First Internship and Injury",
    "desc": [
      {
        "p": "After completing my coursework for an associate's degree in engineering, I was eager to gain practical experience. I secured an internship at Adbay (now Kalen Marketing Solutions) as a backend website developer, where I worked closely with Bradley Erickson. Throughout the summer, I engaged in a variety of projects, including revitalizing an older PHP-based scraping project for the company's WordPress site, Oil City News. This internship provided me with a comprehensive understanding of the full web development process."
      },
      {
        "p": "However, during the spring semester, I encountered a significant setback when I suffered a traumatic injury—a full angular fracture of my sternum and a broken, dislocated rib. Despite these challenges, I persevered and managed to complete the semester with minimal accommodations. Unfortunately, the injury was initially misdiagnosed, and I re-injured my sternum during a routine workout just weeks before I was set to transfer to the University of Wyoming."
      }
    ]
  },
    {
    "date": "2018",
    "title": "The University of Wyoming and Wyohackathon",
    "desc": [
      {
        "p": "In the fall of 2018, I transitioned to the University of Wyoming, eager to continue my education despite facing significant challenges. Adjusting to the new curriculum proved daunting, compounded by ongoing pain and sleep deprivation from a lingering injury. It took 14 months to receive a proper diagnosis, during which I navigated a revised physical therapy regimen that finally showed signs of improvement by summer 2019. Juggling medical appointments, therapy sessions, and academic responsibilities became my daily routine."
      },
      {
        "p": "Despite these obstacles, I participated in the Wyohackathon, a pivotal experience where I collaborated on a blockchain project alongside Gabriel Cardona, then a senior software engineer with Bitcoin Cash. This opportunity provided unique insights into blockchain technology, typically accessible only to graduate students."
      }
    ]
  },
    {
    "date": "2019",
    "title": "Second Internship",
    "desc": [
      {
        "p": "I was fortunate to return for a second internship at Adbay (now Kalen Marketing Solutions), where my familiarity with the team and their understanding of my skills afforded me more autonomy. This time, I was tasked with revamping the scraping project I had worked on the previous summer. Given the freedom to choose, I opted to rewrite the scraper in Python, leveraging skills I had developed earlier that year."
      },
      {
        "p": "Midway through the internship, I successfully completed the project, revitalizing the 'Warrant Round up' plugin for Oil City News. Encouraged by its success, the CEO and senior developer proposed expanding the project to include another plugin. For the remainder of the summer, I adapted the scraper to gather housing information from MLS listings in targeted areas."
      },
      {
        "p": "In addition to my individual project, I collaborated with fellow interns on a group project, 'Free Film Friday,' as part of a promotional campaign. Our team built and populated a website and emailer, allowing users to sign up for newsletters to stay informed about event schedules and locations."
      }
    ]
  },
    {
    "date": "2019 - 2020",
    "title": "Senior Design Project and Global Game Jam",
    "desc": [
      {
        "p": "In the Fall semester of 2019, I participated in the Global Game Jam hosted at our school by the Wyoming Game Devs group. This intensive weekend-long event challenged teams to develop innovative games under tight deadlines."
      },
      {
        "p": "During Fall 2019 through Spring 2020, I began work on my senior design project with a team, while managing normal coursework and undergoing physical therapy. As part of a three-person team collaborating with Western EcoSystems Technology, Inc., our goal was to develop software for a DJI drone. The aim was to convert 4K footage into a format suitable for real-time processing by WEST's AI model."
      },
      {
        "p": "Despite making promising progress, our project encountered setbacks due to the global pandemic, which restricted our access to the necessary drone equipment. We pivoted our approach to salvage a viable solution, focusing on converting 4K footage into a stream-readable format for live processing by their AI. This adaptation ensured continuity and prepared our project for future development, emphasizing optimization for the DJI drone's hardware limitations."
      }
    ]
  },
    {
    "date": "2020 - 2021",
    "title": "The Global Pandemic and Post Grad Work",
    "desc": [
      {
        "p": "The onset of the global pandemic brought about significant changes in daily life. Recognizing the opportunity presented by full remote availability for classes, I decided to relocate to Phoenix, Arizona. My goal was twofold: to pursue post-graduate work in industry and to alleviate the persistent pain from a long-standing injury."
      },
      {
        "p": "Despite the challenges posed by the pandemic, I successfully completed most of my remaining coursework remotely. However, I encountered an issue when my university did not offer two essential courses within the remote course timeframe. Undeterred, I sought similar courses at other universities in Arizona in an effort to fulfill my degree requirements. Regrettably, the University of Wyoming was unable to accept equivalent coursework from these institutions."
      }
    ]
  },
    {
    "date": "2022",
    "title": "Beginning my Career with Teladoc",
    "desc": [
      {
        "p": "In 2022, I began my journey with Teladoc Health after a rigorous interview process. Despite the requirement to relocate back to Wyoming to complete my degree, Teladoc recognized my exceptional skill set, which they deemed competitive even among applicants with bachelor’s and master’s degrees. They offered me a full-time position as a Front End Software Engineer, and I commenced my career with them."
      },
      {
        "p": "I worked remotely for my time with Teladoc, spending my first year in Phoenix, AZ. I actively participated in daily standups with the myStrength team, contributed to biweekly sprint planning and retrospectives, and engaged in quarterly planning meetings. Embracing an agile methodology, we focused on continuous feedback and improvement. My responsibilities included extensive work on prod support for both internal and client-facing issues, as well as planning and implementing features across various platforms, both internal and client-facing."
      },
      {
        "p": "Throughout my tenure, I seized opportunities for professional growth and development. I was selected for special task forces aimed at swiftly resolving high-priority client issues. I gaining valuable insights into the entire software development lifecycle from inception to deployment. By the end of 2023, I assumed the role of Lead Front End Software Engineer for the myStrength team, overseeing the migration of clients and services from our legacy CMS to the new unified oneApp CMS, which integrated a third-party identity brokering service."
      },
      {
        "p": "Towards the end of 2023, I made the decision to return to Wyoming to leverage Teladoc's tuition reimbursement benefits and pursue management classes to advance my career. Additionally, being closer to Denver facilitated my participation in quarterly planning meetings and other company events, as our team's main office was located there. Collaborating closely with my project manager, Colin Starner, we formulated strategies for achieving the improvements necessary for a promotion to a more senior role within the company, setting our plan in motion in December in preparation for the upcoming annual planning week in January."
      }
    ]
  },
    {
    "date": "2024",
    "title": "Current Objectives and Path Going Forward",
    "desc": [
      {
        "p": "In mid-January 2024, I received unexpected news of a Reduction in Workforce (RIWF) at my previous company, resulting in my departure. This decision was made several management levels above my direct supervisor, Colin, whom I had the opportunity to reconnect with during this period of transition."
      },
      {
        "p": "Since the layoff, I have been dedicated to continuous professional development, focusing on enhancing my skills and expanding my knowledge base. Reconnecting with the University of Wyoming, I am actively strategizing on completing my degree, a process complicated by the accumulation of over 200 credits. Concurrently, I am deeply involved in developing and building this web application, a testament to my ongoing commitment to technological innovation."
      },
      {
        "p": "Currently, I am actively seeking my next opportunity in software engineering, eager to leverage my diverse skill set and experience in contributing to innovative projects and teams."
      }
    ]
  }
]